---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexLine.GetSizeInShortInts
source: html/fddd1d58-98b7-099c-36a2-f16c4c6a3510.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexLine.GetSizeInShortInts Method

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.

## Syntax (C#)
```csharp
public static int GetSizeInShortInts()
```

## Returns
The number of short integers occupied by the primitive.